app/controllers/comentarios_controller.rb

SELECT * FROM `comentarios`
---
  def index
    @comentarios = Comentario.all

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 1)
---
  def show
    @comentario = Comentario.find(params[:id])

INSERT INTO `comentarios` (`created_at`, `updated_at`, `conteudo`, `comentavel_type`, `comentavel_id`) VALUES('2010-08-18 21:57:40', '2010-08-18 21:57:40', 'Testando', 'padaria', 0)
---
  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|
      if @comentario.save

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 2)
DELETE FROM `comentarios` WHERE `id` = 2
---
  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy