app/controllers/padarias_controller.rb

	def index
		@padarias = Padarias.paginate :page => params['page'], :per_page => 3
---
SELECT * FROM `padarias` ORDER BY nome

	def show
		@padaria = Padaria.find(params[:id])
---
SELECT * FROM `padarias` WHERE (`padarias`.`id` = 1)

	def create
		@padaria = Padaria.new(params[:padaria])
		if @padaria.save
---
INSERT INTO `padarias` (`endereco`, `created_at`, `nome`, `updated_at`, `especialidade`) VALUES('Rua Barao da Torre', '2010-08-17 00:53:04', 'Macdonalds', '2010-08-17 00:53:04', 'Feijoada')

	def edit
		@padaria = Padaria.find(params[:id])
---
SELECT * FROM `padarias` WHERE (`padarias`.`id` = 1)

	def destroy
		@padaria = Padaria.find(params[:id])
---
SELECT * FROM `padarias` WHERE (`padarias`.`id` = 1)