app/controllers/qualificacoes_controller.rb

  def new
    @qualificacao = Qualificacao.new
	if params[:cliente]
		@qualificacao.cliente = Cliente.find(params[:cliente])
---
SELECT * FROM `clientes` WHERE (`clientes`.`id` = 1)